<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $permissions = [
        	'အရောင်များ-အားလုံးကြည့်မည်',
        	'အရောင်များ-အသစ်ထပ်ထည့်မည်',
            'အရောင်များ-ပြင်ဆင်မည်',
            'အရောင်များ-ဖျက်မည်',

            'ကားအမှတ်တံဆိပ်-အားလုံးကြည့်မည်',
        	'ကားအမှတ်တံဆိပ်-အသစ်ထပ်ထည့်မည်',
            'ကားအမှတ်တံဆိပ်-ပြင်ဆင်မည်',
            'ကားအမှတ်တံဆိပ်-ဖျက်မည်',

            'ပစ္စည်းအမျိုးအစား-အားလုံးကြည့်မည်',
        	'ပစ္စည်းအမျိုးအစား-အသစ်ထပ်ထည့်မည်',
            'ပစ္စည်းအမျိုးအစား-ပြင်ဆင်မည်',
            'ပစ္စည်းအမျိုးအစား-ဖျက်မည်',

            'ထုတ်လုပ်သည့်နိုင်ငံ-အားလုံးကြည့်မည်',
        	'ထုတ်လုပ်သည့်နိုင်ငံ-အသစ်ထပ်ထည့်မည်',
            'ထုတ်လုပ်သည့်နိုင်ငံ-ပြင်ဆင်မည်',
            'ထုတ်လုပ်သည့်နိုင်ငံ-ဖျက်မည်',

            'ကားအမျိုးအစား-အားလုံးကြည့်မည်',
        	'ကားအမျိုးအစား-အသစ်ထပ်ထည့်မည်',
            'ကားအမျိုးအစား-ပြင်ဆင်မည်',
            'ကားအမျိုးအစား-ဖျက်မည်',

            'ကားပစ္စည်း-အားလုံးကြည့်မည်',
            'ကားပစ္စည်း-အသစ်ထပ်ထည့်မည်',
            'ကားပစ္စည်း-အသေးစိတ်ကြည့်မည်',
            'ကားပစ္စည်း-ပြင်ဆင်မည်',
            'ကားပစ္စည်း-ဖျက်မည်',

            'ကားပစ္စည်းstock-အားလုံးကြည့်မည်',
            'ကားပစ္စည်းstock-အသစ်ထပ်ထည့်မည်',
            'ကားပစ္စည်းstock-ပြင်ဆင်မည်',
            'ကားပစ္စည်းstock-ဖျက်မည်',

            'spa-အားလုံးကြည့်မည်',
            'spa-အသစ်ထပ်ထည့်မည်',
            'spa-အသေးစိတ်ကြည့်မည်',
            'spa-ပြင်ဆင်မည်',
            'spa-ဖျက်မည်',

            'supplier-အားလုံးကြည့်မည်',
            'supplier-အသစ်ထပ်ထည့်မည်',
            'supplier-ပြင်ဆင်မည်',
            'supplier-ဖျက်မည်',

            'customer-အားလုံးကြည့်မည်',
            'customer-ဖျက်မည်',

            'staff-အားလုံးကြည့်မည်',
           	'staff-အသစ်ထပ်ထည့်မည်',
            'staff-အသေးစိတ်ကြည့်မည်',

           	'staff-ပြင်ဆင်မည်',
           	'staff-ဖျက်မည်',

           	'စျေးရောင်းမည်',

           	'အသုံးစာရင်း-အားလုံးကြည့်မည်',
           	'အသုံးစာရင်း-အသစ်ထပ်ထည့်မည်',
           	'အသုံးစာရင်း-ပြင်ဆင်မည်',
           	'အသုံးစာရင်း-ဖျက်မည်',

           	'အရောင်းအ၀ယ်စာရင်း-အားလုံးကြည့်မည်'


        ];


        foreach ($permissions as $permission) {
             Permission::create(['name' => $permission]);
        }
    }
}
